Revit 2027 API
ParameterTypeId.StructuralAnalyticalModel Property
 "Enable Analytical Model"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAnalyticalModel { get; }
Public Shared ReadOnly Property StructuralAnalyticalModel As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAnalyticalModel {
	ForgeTypeId^ get ();
}
static member StructuralAnalyticalModel : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace